Repository: ZheglY/aiogram-telegram-ai-tgbot
Catalog: bot/locales/*/LC_MESSAGES/messages.po
Languages: es, fr, ru

# welcome_message
source: 👋 Welcome to the JZ Telegram bot! I am your intelligent assistant, ready to help you create creative content. 💬 Chat with AI — discuss an idea, ask a question, or just have a conversation 🖼 Image generation — describe what you want to see, and I’ll create it ℹ️ To learn more about the bot’s features and change the language, use the /help command Ready to start? Let’s go! 🚀
es: 👋 ¡Bienvenido al bot de Telegram JZ! Soy tu asistente inteligente, listo para ayudarte a crear contenido creativo. 💬 Chat con IA — discute una idea, haz una pregunta o simplemente charla 🖼 Generación de imágenes — describe lo que quieres ver y lo crearé ℹ️ Para conocer más sobre las funciones del bot y cambiar el idioma, usa el comando /help ¿Listo para empezar? ¡Vamos allá! 🚀
fr: 👋 Bienvenue sur le bot Telegram JZ ! Je suis ton assistant intelligent, prêt à t’aider à créer du contenu créatif. 💬 Chat avec l’IA — discute d’une idée, pose une question ou échange simplement 🖼 Génération d’images — décris ce que tu veux voir et je le créerai ℹ️ Pour en savoir plus sur les fonctionnalités du bot et changer la langue, utilise la commande /help Prêt à commencer ? C’est parti ! 🚀
ru: 👋 Добро пожаловать в Telegram-бот JZ! Я — ваш интеллектуальный помощник, готов помочь в создании креативного контента. 💬 Чат с ИИ — обсудите идею, задайте вопрос или просто пообщайтесь 🖼 Генерация изображений — опишите, что хотите увидеть, и я создам это ℹ️ Чтобы узнать больше о возможностях бота и изменить язык, используйте команду /help Готовы начать? Поехали! 🚀

# already_registered_welcome_message
source: 👋 Welcome back! How can I help you today?
es: 👋 ¡Nos alegra verte de nuevo! ¿En qué puedo ayudarte?
fr: 👋 Ravi de te revoir ! Comment puis-je t’aider ?
ru: 👋 Рады снова вас видеть! Чем могу помочь?

# help_message
source: Bot commands: /menu — 🌟 Main menu /history — 🕒 Request history /language — 🌍 Change interface language If you encounter an error or want to leave feedback — click the button below.
es: Comandos del bot: /menu — 🌟 Menú principal /history — 🕒 Historial de solicitudes /language — 🌍 Cambiar idioma de la interfaz Si encontraste un error o quieres dejar un comentario — pulsa el botón de abajo.
fr: Commandes du bot : /menu — 🌟 Menu principal /history — 🕒 Historique des requêtes /language — 🌍 Changer la langue de l’interface Si tu rencontres une erreur ou souhaites laisser un commentaire — clique sur le bouton ci-dessous.
ru: Команды бота: /menu — 🌟 Главное меню /history — 🕒 История запросов /language — 🌍 Сменить язык интерфейса Если возникла ошибка или вы хотите оставить отзыв — нажмите кнопку ниже.

# menu_message
source: 🌟 You are in the JZ bot menu Choose one of the options below: ⁉️For more information, use the /help command.
es: 🌟 Estás en el menú del bot JZ Elige una de las opciones a continuación: ⁉️Para más información, usa el comando /help.
fr: 🌟 Tu es dans le menu du bot JZ Choisis une option ci-dessous : ⁉️Pour plus d’infos, utilise la commande /help.
ru: 🌟 Вы находитесь в меню бота JZ Выберите одну из опций ниже: ⁉️Для получения дополнительной информации используйте команду /help.

# button_generate_picture
source: 🖼️ Generate Image
es: 🖼️ Generar imagen
fr: 🖼️ Générer une image
ru: 🖼️ Сгенерировать изображение

# button_chat_with_ai
source: 💬 Chat with AI
es: 💬 Chat con IA
fr: 💬 Chat avec l’IA
ru: 💬 Чат с ИИ

# change_language_message
source: 🌍 Want to change the language? Choose an option below.
es: 🌍 ¿Quieres cambiar el idioma? Elige una opción abajo.
fr: 🌍 Tu veux changer de langue ? Choisis une option ci-dessous.
ru: 🌍 Хотите сменить язык? Выберите нужный вариант ниже.

# button_change_language
source: 🌐 Change Language
es: 🌐 Cambiar idioma
fr: 🌐 Changer de langue
ru: 🌐 Сменить язык

# support_button
source: 📩 Leave feedback or report an issue
es: 📩 Enviar comentario o informar de un error
fr: 📩 Laisser un commentaire ou signaler un bug
ru: 📩 Оставить отзыв или сообщение об ошибке

# support_message
source: Please describe the issue or suggest an improvement.
es: Por favor, describe el error o sugiere una mejora.
fr: Merci de décrire l’erreur ou de proposer une amélioration.
ru: Пожалуйста, опишите ошибку или предложите улучшение.

# saved_feedback
source: Thank you for your feedback! Your opinion matters and will be taken into account.
es: ¡Gracias por tu comentario! Tu opinión es importante y la tendremos en cuenta.
fr: Merci pour ton retour ! Ton avis compte et sera pris en compte.
ru: Спасибо за отзыв! Ваше мнение важно, и мы обязательно его учтём.

# go_to_menu
source: 🌟 Back to menu
es: 🌟 Volver al menú
fr: 🌟 Retour au menu
ru: 🌟 Вернуться в меню

# user_last_request
source: 🕒 Request history: (click the button below to view the bot's response)
es: 🕒 Historial de solicitudes: (haz clic en el botón de abajo para ver la respuesta del bot)
fr: 🕒 Historique des requêtes : (clique sur le bouton ci-dessous pour voir la réponse du bot)
ru: 🕒 История запросов: (нажмите на кнопку ниже, чтобы просмотреть ответ бота)

# request_generate_picture
source: 🖼 Describe what you want to see — and our JZ bot will generate a unique image! ✨
es: 🖼 Escribe lo que quieres ver, ¡y nuestro bot JZ generará una imagen única! ✨
fr: 🖼 Décris ce que tu veux voir — et notre bot JZ générera une image unique ! ✨
ru: 🖼 Напишите, что хотите увидеть — и наш бот JZ сгенерирует уникальное изображение! ✨

# request_generate_text
source: 💬 Write anything — the JZ bot will reply to you right away!
es: 💬 Escribe lo que quieras — ¡el bot JZ te responderá de inmediato!
fr: 💬 Écrivez ce que vous voulez — le bot JZ vous répondra immédiatement !
ru: 💬 Напишите что угодно — бот JZ ответит вам прямо сейчас!

# wait for image
source: Image is being generated...
es: La imagen se está generando...
fr: L'image est en cours de génération...
ru: Изображение генерируется...

# echo_message
source: 😣I don't understand you... Please use commands or type /help for more information.
es: 😣No te entiendo... Usa comandos o escribe /help para más información.
fr: 😣 Je ne vous comprends pas... Veuillez utiliser des commandes ou tapez /help pour plus d'informations.
ru: 😣 Я вас не понимаю... Используйте команды или напишите /help для дополнительной информации.
